import pandas as pd
import numpy as np

def generate_doctors_excel(num_doctors=200):
    data = {
        'نام': np.random.choice([
            'علی', 'محمد', 'حسین', 'رضا', 'فاطمه', 'زهرا', 'مریم', 'زینب', 'مهدی', 'امیر', 'آزاده', 'ندا', 'سارا', 'کسری', 'کوروش'
        ], num_doctors),
        'نام خانوادگی': np.random.choice([
            'محمدی', 'حسینی', 'فاطمی', 'رضایی', 'کریمی', 'جعفری', 'عزیزی', 'احمدی', 'صادقی', 'نوروزی', 'ابراهیمی', 'اکبری', 'باقری', 'مرادی'
        ], num_doctors),
        'تحصیلات': np.random.choice(['دکترای عمومی', 'پزشک متخصص', 'فوق تخصص'], num_doctors),
        'رشته تخصصی': np.random.choice([
            'قلب و عروق', 'اطفال', 'پوست و مو', 'اعصاب و روان', 'داخلی',
            'ارتوپدی', 'زنان و زایمان', 'گوش و حلق و بینی', 'چشم پزشکی',
            'جراحی عمومی', 'اورولوژی', 'غدد', 'تغذیه', 'فیزیوتراپی'
        ], num_doctors),
        'سابقه (سال)': np.random.randint(2, 30, num_doctors),
        'شهر': np.random.choice([
            'تهران', 'مشهد', 'اصفهان', 'شیراز', 'تبریز', 'اهواز', 'کرج', 'یزد',
            'کرمان', 'رشت', 'ساری', 'بندرعباس', 'ارومیه', 'زاهدان', 'همدان'
        ], num_doctors),
        'امتیاز نظرسنجی مشتری (از عدد 10)': np.random.randint(6, 11, num_doctors),
        'وضعیت بیماران پذیرشی': np.random.choice(['بسیار اورژانسی', 'اورژانسی', 'مهم نیست'], num_doctors),
        'تسلط به زبان محاوره': np.random.choice(['فقط فارسی', 'انگلیسی و فارسی'], num_doctors),
        'ترجیحات و علاقمندیها': np.random.choice([
            'جراحی لاپاراسکوپی', 'پزشکی ورزشی', 'انکولوژی', 'ژنتیک', 'طب سنتی',
            'پزشکی هسته ای', 'پزشکی مولکولی', 'روانپزشکی کودک و نوجوان', 'طب اورژانس'
        ], num_doctors)
    }

    df = pd.DataFrame(data)
    df.to_excel('doctors_data.xlsx', index=False)
    print("فایل doctors_data.xlsx با موفقیت ایجاد شد.")

if __name__ == "__main__":
    generate_doctors_excel() 